Revit 2020 API
ImageTypeLoadedStatus Enumeration
 Indicates the current state of the contents of the ImageType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2020
Since: 2020
Syntax
C#
public enum ImageTypeLoadedStatus
Visual Basic
Public Enumeration ImageTypeLoadedStatus
Visual C++
public enum class ImageTypeLoadedStatus
Members
Member name | Description
NotLoaded |  No attempt to load the ImageType has been made. No image is available.
Loaded |  The contents of ImageType was loaded.
See Also
Autodesk.Revit.DB Namespace